Masmiseim36/nxpSDK/boards/frdmkv31f/bootloader_examples/freedom_bootloader/pin_mux.h
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name PORTE4 (number 5), SW3
  @{ */
#define BOOT_PIN_SW3_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOOT_PIN_SW3_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOOT_PIN_SW3_PIN 4U     /*!<@brief PORTE pin index: 4 */
                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBootPin(void);

/*! @name PORTB16 (number 62), U7[4]/UART0_RX_TGTMCU
  @{ */
#define UART0_POLLFORACTIVITY_RX_GPIO_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define UART0_POLLFORACTIVITY_RX_GPIO_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_POLLFORACTIVITY_RX_GPIO_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_PollForActivity(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

/*! @name PORTB16 (number 62), U7[4]/UART0_RX_TGTMCU
  @{ */
#define UART0_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_RX_PIN 16U    /*!<@brief PORTB pin index: 16 */
                            /* @} */

/*! @name PORTB17 (number 63), U10[1]/UART0_TX_TGTMCU
  @{ */
#define UART0_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_TX_PIN 17U    /*!<@brief PORTB pin index: 17 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_InitPins(void);

/*! @name PORTB16 (number 62), U7[4]/UART0_RX_TGTMCU
  @{ */
#define UART0_RESTOREDEFAULT_RX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_RESTOREDEFAULT_RX_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                           /* @} */

/*! @name PORTB17 (number 63), U10[1]/UART0_TX_TGTMCU
  @{ */
#define UART0_RESTOREDEFAULT_TX_PORT PORTB /*!<@brief PORT device name: PORTB */
#define UART0_RESTOREDEFAULT_TX_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void UART0_RestoreDefault(void);

/*! @name PORTB2 (number 55), J2[20]/ADC0_SE12/I2C0_SCL
  @{ */
#define I2C0_SCL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_SCL_PIN 2U     /*!<@brief PORTB pin index: 2 */
                            /* @} */

/*! @name PORTB1 (number 54), J2[18]/ADC0_SE9/I2C0_SDA
  @{ */
#define I2C0_SDA_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_SDA_PIN 1U     /*!<@brief PORTB pin index: 1 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C0_InitPins(void);

/*! @name PORTB2 (number 55), J2[20]/ADC0_SE12/I2C0_SCL
  @{ */
#define I2C0_RESTOREDEFAULT_SCL_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_RESTOREDEFAULT_SCL_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                           /* @} */

/*! @name PORTB1 (number 54), J2[18]/ADC0_SE9/I2C0_SDA
  @{ */
#define I2C0_RESTOREDEFAULT_SDA_PORT PORTB /*!<@brief PORT device name: PORTB */
#define I2C0_RESTOREDEFAULT_SDA_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void I2C0_RestoreDefault(void);

/*! @name PORTE16 (number 10), J1[15]
  @{ */
#define SPI0_PCS_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_PCS_PIN 16U    /*!<@brief PORTE pin index: 16 */
                            /* @} */

/*! @name PORTE17 (number 11), J2[12]/SPI0_SCK
  @{ */
#define SPI0_SCK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_SCK_PIN 17U    /*!<@brief PORTE pin index: 17 */
                            /* @} */

/*! @name PORTE18 (number 12), J2[8]/SPI0_SOUT
  @{ */
#define SPI0_SOUT_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_SOUT_PIN 18U    /*!<@brief PORTE pin index: 18 */
                             /* @} */

/*! @name PORTE19 (number 13), J2[10]/SPI0_SIN
  @{ */
#define SPI0_SIN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_SIN_PIN 19U    /*!<@brief PORTE pin index: 19 */
                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI0_InitPins(void);

/*! @name PORTE16 (number 10), J1[15]
  @{ */
#define SPI0_RESTOREDEFAULT_PCS_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_PCS_PIN 16U    /*!<@brief PORTE pin index: 16 */
                                           /* @} */

/*! @name PORTE17 (number 11), J2[12]/SPI0_SCK
  @{ */
#define SPI0_RESTOREDEFAULT_SCK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_SCK_PIN 17U    /*!<@brief PORTE pin index: 17 */
                                           /* @} */

/*! @name PORTE18 (number 12), J2[8]/SPI0_SOUT
  @{ */
#define SPI0_RESTOREDEFAULT_SOUT_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_SOUT_PIN 18U    /*!<@brief PORTE pin index: 18 */
                                            /* @} */

/*! @name PORTE19 (number 13), J2[10]/SPI0_SIN
  @{ */
#define SPI0_RESTOREDEFAULT_SIN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define SPI0_RESTOREDEFAULT_SIN_PIN 19U    /*!<@brief PORTE pin index: 19 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void SPI0_RestoreDefault(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
